Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Due to the single JVM execution mode, it is also possible to debug Flink applications in an IDE almost like any other program in your IDE.
zh_cn: 由于单JVM执行模式的存在，你可以像调试其他程序那样在IDE中调试Flink应用，

source: Due to these limitations, MemoryStateBackend is only rec‐ ommended for development and debugging purposes.
zh_cn: 由于存在这些限制，我们建议仅将MemoryStateBackend用于开发和调试。

source: Due to this feature, Flink’s Kafka sink is also able to provide exactly-once output guarantees given that the sink and Kafka are properly configured.
zh_cn: 由于有了该功能，Flink的kafka数据汇同样可以在自身和kafka都正确配置的前提下提供精确一次的输出保障。

source: Due to this replication of data, the data stores must be kept in sync.
zh_cn: 由于数据存在多个副本，这些数据存储系统之间需要保持同步。

source: Duplicate processing might be acceptable if application correctness only depends on the completeness of information.
zh_cn: 如果正确性仅依赖信息的完整度，那重复处理或许可以接受。

source: Dupli‐ cate processing might be acceptable if application correctness only depends on the completeness of information.
zh_cn: 如果正确性仅依赖信息的完整度，那重复处理或许可以接受。

source: During exe‐ cution, the JobManager is responsible for all actions that require a central coordi‐ nation such as the coordination of checkpoints (see later section).
zh_cn: 在执行过程中，JobManager负责所有需要集中协调的行为，例如：checkpoint协调（下节会提到）。

source: During execution, a TaskManager exchanges data with other TaskManagers that run tasks of the same application.
zh_cn: 执行期间，运行同一应用不同任务的TaskManager之间会产生数据交换。

source: During execution, the JobManager is responsible for all actions that require a central coordination such as the coordination of check‐ points (see “Checkpoints, Savepoints, and State Recovery”).
zh_cn: 在执行过程中，JobManager还要负责所有需要集中协调的操作，例如，创建检查点（见"检查点、保存点及状态恢复"）。

source: During execution, the sink registers the query as a
zh_cn: 执行过程中，数据汇会将该查询注册为一个预编译语句（prepared statement），并将元组、样例类或Row类型的字段转化为该语句相应的参数。

source: During recovery, all records of not- yet-committed checkpoints will be written again.
zh_cn: 这样，在故障恢复期间，未提交的检查点所对应的全部记录都会被重写一次。

source: During the execution of a streaming application, Flink periodically takes consistent checkpoints of the application’s state.
zh_cn: 在流式应用执行过程中，Flink会周期性地为应用状态生成检查点。

source: During the execution of an application, the JobManager receives the state handles (storage locations) of the individual task checkpoints.
zh_cn: 在应用执行过程中，JobManager会接收每个任务检查点的状态句柄（存储位置）。

source: ETL jobs periodically import data into a data store and the data is pro‐ cessed by ad-hoc or scheduled queries.
zh_cn: ELT作业周期性地把数据导入数据存储系统，并通过即席或计划查询处理数据。

source: ETL jobs periodically import data into a datastore and the data is processed by ad-hoc or scheduled queries.
zh_cn: ELT作业会周期性地把数据导入数据存储系统，并通过即席或计划查询处理数据。

source: ETL processes can be quite complex and often require technically sophisticated solutions to meet performance requirements.
zh_cn: 该流程可能会非常麻烦，通常需要复杂的技术方案来满足性能要求。

source: ETL processes need to run periodically to keep the data in the data warehouse synchronized.
zh_cn: 为了保持数据仓库中的数据同步，ETL过程需要周期性地执行。

source: Each TaskManager has a pool of network buffers (by default 32 KB in size) to send and receive data.
zh_cn: 每个TaskManager都有一个用于收发数据的网络缓冲池（默认32KB大小）。

source: Each TaskManager has a pool of network buffers (by default 32KB in size) which are used to send and receive data.
zh_cn: 每个TaskManager有一个用于收发数据的网络缓冲区池（默认32KB大小）。

source: Each TaskManager provides a certain number of slots.
zh_cn: 每个TaskManager提供一定数量的处理槽。

source: Each TaskMan‐ ager runs a state server that fetches the state of a queried key from the local state
zh_cn: 状态服务器同样需要运行在每个TaskManager上面。它会根据查询的键值从本地状态后端取得状态，

source: Each Task‐ Manager runs a client proxy.
zh_cn: 该客户端代理需要在每个TaskManager上面都运行一个。

source: Each application can be stateful and can locally manage its own state without accessing external datastores.
zh_cn: 每个应用都可以是状态化的，只需要管理自身状态而无须访问外部数据存储。

source: Each application can be stateful, i.e., locally manage its own state without accessing external data stores.
zh_cn: 每个应用都可以是状态化的，只需要管理自身状态而无须访问外部数据存储。

source: Each bucket directory contains multiple part files that are concurrently written by multiple parallel instances of the StreamingFileSink.
zh_cn: 每个桶对应的目录下都会包含很多分块文件（part file），由StreamingFileSink的多个并行实例对它们进行并发写入。

source: Each class of systems has been designed for specific access patterns and excels at serving a certain purpose.
zh_cn: 每一类系统都是针对某个特定的访问模式而设计的，它们在服务方面各有所长。

source: Each component has the follow‐ ing responsibilities:
zh_cn: 它们各自的职责如下：

source: Each component provides its own guarantees and the end-to-end guarantee of the complete pipeline would be the weakest of each of its components.
zh_cn: 在每个组件都提供自身的保障情况下，整个处理管道上端到端的保障会受制于保障最弱的那个组件。

source: Each descriptor defines a separate broadcast state of the function that is later applied on the BroadcastStream.
zh_cn: 每个描述符都会为将来用于BroadcastStream的函数定义一个单独的广播状态。

source: Each event carries a timestamp and the logical time of the system is defined by watermarks.
zh_cn: 每个事件时间都带有一个时间戳，而系统的逻辑时间是由水位线来定义。

source: Each event must be associated with a timestamp that typically indicates when the event actually happened.
zh_cn: 每个事件都需要关联一个时间戳，该时间戳通常用来表示事件的实际发生时间；

source: Each incoming event can be routed to zero, one, or more output streams.
zh_cn: 每一个到来的事件都可以被发往零个、一个或多个输出流。

source: Each operator can define one or more keyed and operator states.
zh_cn: 而每个算子又可以定义一个或多个的键值或算子状态。

source: Each operator is a member of a slot-sharing group.
zh_cn: 具体而言，每个算子都会属于一个处理槽共享组。

source: Each operator is parallelized into one or multiple tasks.
zh_cn: 每个算子都会产生一个或多个并行任务。

source: Each parallel source task can read from one or more partitions.
zh_cn: 每个并行数据源任务都可以从一个或多个分区读取数据。

source: Each partition is a stream of timestamped records and watermarks.
zh_cn: 每个分区作为一个数据流，都会包含带有时间戳的记录以及水位线。

source: Each partition is processed by a task that computes the sum of all received numbers and forwards the updated sum to a sink.
zh_cn: 每一部分都会有一个任务负责对收到的全部数字求和，并将结果值更新至下游数据汇。

source: Each reading will be added to four win‐ dows.
zh_cn: 每个读数将被放入四个窗口中。

source: Each row can be uniquely identified by its primary key.
zh_cn: 每一行都以其主键作为唯一标识。

source: Each sender task needs at least four network buffers to send data to each receiver task and each receiver task requires at least four buffers to receive data.
zh_cn: 每个发送端任务至少需要4个网络缓冲区来向任一接收端任务发送数据；同理每个接收端任务也需要至少4个缓冲区来接收数据。

source: Each slot can process one slice of an application, one parallel task of every operator of the application.
zh_cn: 每个处理槽可以处理应用的一个"切片"，即应用程序每个算子的一个并行任务。

source: Each state is registered with a name that must be unique for the function.
zh_cn: 每个状态在注册时都要提供一个函数范围内唯一的名称。

source: Each task will process a subset of the operator’s input stream.
zh_cn: 每个任务负责处理算子输入流的一部分。

source: Each win‐ dow object has an end timestamp that defines the point in time after which the window and its state can be deleted.
zh_cn: 每个窗口对象都有一个结束时间戳，它定义了可以安全删除窗口及其状态的时间点。

source: Earlier in this chapter we explained that Flink can only provide satisfying consistency guarantees for applications that use source connectors that can replay their output data.
zh_cn: 我们在本章的前面部分介绍过，Flink只有在数据源连接器可以重放输出数据的前提下才能为应用提供令人满意的一致性保障。

source: Elements of both input streams are assigned to common windows and joined (or cogrouped) when a window is complete.
zh_cn: 其原理是将两条输入流中的元素分配到公共窗口中并在窗口完成时进行Join（或Cogroup）。

source: Elements that are assigned to a window will be immediately aggregated
zh_cn: 你可以对分配给窗口的元素立即执行聚合，

source: Emitting to Side Outputs
zh_cn: 向副输出发送数据

source: Enabling Failure Recovery for Stateful Applications
zh_cn: 为状态化应用开启故障恢复

source: Enabling checkpoint compression
zh_cn: 启用检查点压缩

source: Enabling checkpointing for an application
zh_cn: 为应用开启检查点功能

source: Encryption and authentication for communication to queryable state is not sup‐ ported yet.
zh_cn: Flini暂不支持对于可查询式状态通信进行加密和身份验证。

source: End- to-end guarantees refer to result correctness across the whole data processing pipe‐ line.
zh_cn: 端到端的保障指的是在整个数据处理管道上结果都是正确的。

source: End-to-end Exactly-Once
zh_cn: 端到端的精确一次

source: End-to-end consistency guarantees for different combinations of sources and sinks
zh_cn: 不同数据源和数据汇组合所能实现的端到端的一致性保障

source: End-to-end exactly-once
zh_cn: 端到端的精确一次

source: End-to-end guarantees refer to result cor‐ rectness across the data processing pipeline.
zh_cn: 端到端的保障指的是在整个数据处理管道上结果都是正确的。

source: Ensure Temporary Directories Are Not Automatically Cleaned
zh_cn: 请确保临时目录不会被自动清除

source: Ensuring low latency is critical for many streaming applications, such as fraud detec‐ tion, raising alarms, network monitoring, and offering services with strict service level agreements (SLAs).
zh_cn: 保证低延迟对很多流式应用而言至关重要，例如：诈骗识别、警报触发、网络监测以及遵循服务级别协议（SLA）的服务。

source: Ensuring low latency is critical for many streaming applications, such as fraud detec‐ tion, system alarms, network monitoring, and offering services with strict service- level agreements.
zh_cn: 保证低延迟对很多流式应用而言至关重要，例如：诈骗识别、系统告警、网络监测以及遵循服务级别协议（SLA）的服务。

source: Ensuring the Maintainability of Stateful Applications
zh_cn: 确保状态化应用的可维护性

source: Ensuring the Maintainability of Stateful Applications | 167
zh_cn: 确保状态化应用的可维护性 | 167

source: Enter the base folder of Flink’s source code and run one of the commands in the following:
zh_cn: 准备好后就可以进入Flink源码根目录，运行下列命令之一：

source: Especially when a streaming job is part of a larger data processing pipeline or event-driven service in a user-facing application, you probably want to monitor its performance as precisely as possible and make sure it meets certain tar‐ gets for latency, throughput, resource utilization, etc.
zh_cn: 尤其是当流式作业是作为一个更大的数据处理管道或面向用户的事件驱动服务的一部分时，你可能需要尽可能准确地监控其性能，并确保它可以满足延迟、吞吐和资源利用等目标。

source: Essentially, it is the time interval between receiving an event and seeing the effect of processing this event in the output.
zh_cn: 本质上，它是从接收事件到在输出中观察到事件处理效果的时间间隔。

source: Essentially, this is a sim‐ plified version of the BucketingFileSink discussed earlier.
zh_cn: 本质上，它是我们之前讨论过的BucketingFileSink的一个简化版本。

source: Estimates mean there is room for errors, in which case you might gen‐ erate watermarks that are inaccurate, resulting in late data or an unnecessary increase in the application’s latency.
zh_cn: 既然是估计，就会有误差，这意味着你可能会生成不准确的水位线，导致出现迟到数据或无谓增加应用处理延迟。

source: Evaluation functions can be aggregations like sum or minimum or custom operations applied on the buck‐ et’s collected elements.
zh_cn: 这些计算函数可以是某些聚合，例如：求和、求最小值或一些直接作用于桶内收集好元素的自定义聚合操作。

source: Evaluation functions can be aggregations like sum or minimum or custom operations applied on the bucket’s col‐ lected elements.
zh_cn: 这些计算函数可以是某些聚合，例如：求和、求最小值，也可以是一些直接作用于桶内收集元素的自定义操作。

source: Even though Flink is a distributed data processing system, you will typically develop and run initial tests on your local machine.
zh_cn: 尽管Flink是一个分布式的数据处理系统，但你通常可以在本地机器上进行开发并运行一些初始测试。

source: Even though low latency is an attractive feature of stream processing, its true value is way beyond just fast analytics.
zh_cn: 尽管低延迟是流处理中一个很吸引人的特性，但流处理的真正价值远不止提供快速分析。

source: Even though low latency is an attractive feature of stream processing, its true value is way beyond just offering fast analytics.
zh_cn: 尽管低延迟是流处理中一个很吸引人的特性，但流处理的真正价值远不止提供快速分析。

source: Even though the underlying DataStream and DataSet APIs are separate, you can implement unified stream and batch analytics in Flink using its higher-level relational APIs: Table API and SQL.
zh_cn: 虽然Flink底层DataStream和DataSet的API是分开的，但你可以使用高层次的关系型API——Table API和SQL，实现流批一体的分析。

source: Even though time information and watermarks are crucial to many streaming appli‐ cations, you might have noticed that we cannot access them through the basic Data‐
zh_cn: 虽然时间信息和水位线对于很多流式应用都至关重要，但你可能已经注意到，我们无法通过前面介绍的DataStream API转换来访问它们。

source: Even though when writing the book we intended for it to be read in chapter order, readers familiar with a chapter’s content might want to skip it and readers excited about writing Flink code right away might want to read the practical chapters first.
zh_cn: 尽管我们在写书的时候是按照预期的阅读顺序进行章节编排，但如果你已经对某些章节的内容很熟悉，仍然可以选择跳过；或者如果你迫不及待想接触Flink代码也可以选择先阅读实践章节。

source: Event Time
zh_cn: 事件时间

source: Event Time Processing
zh_cn: 事件时间处理

source: Event time
zh_cn: 事件时间

source: Event time completely decouples the processing speed from the results.
zh_cn: 事件时间将处理速度和结果内容彻底解耦。

source: Event time correctly places events in a window, reflecting the reality of how things happened
zh_cn: 事件时间准确地将事件分配到窗口中，从而反映出真实发生的情况。

source: Event time is based on a timestamp that is attached on the events of the stream.
zh_cn: 它源自附加在流中事件的时间戳。

source: Event time is based on a timestamp that is attached to the events of the stream.
zh_cn: 它以附加在数据流中事件的时间戳为依据。

source: Event time is the time when an event in the stream actually happened.
zh_cn: 事件时间是数据流中事件实际发生的时间，

source: Event-Driven Applications
zh_cn: 事件驱动型应用

source: Event-Time Processing
zh_cn: 事件时间处理

source: Event-Time Processing | 47
zh_cn: 事件时间处理 | 47

source: Event-driven Applications
zh_cn: 事件驱动型应用

source: Event-driven applications are an evolution of microservices.
zh_cn: 事件驱动型应用本质上是之前讨论的微服务的演变。

source: Event-driven applications are an evolution of the previously discussed microservices.
zh_cn: 事件驱动型应用本质上是之前讨论的微服务的演变。

source: Event-driven applications are an interesting design pattern because they offer several benefits compared to the traditional architecture of separate storage and compute tiers or the popular microservice architectures.
zh_cn: 事件驱动型应用的设计模式之所以引起大家关注，主要是因为它和计算存储相互独立的传统架构以及流行的微服务架构相比，有很多优势。

source: Event-driven applications are stateful streaming applications that ingest event streams and apply business logic on the received events.
zh_cn: 事件驱动型应用是一类通过接收事件流触发业务逻辑的状态化流式应用。

source: Event-driven applications are stateful streaming applications that ingest event streams and process the events with application-specific business logic.
zh_cn: 事件驱动型应用是一类通过接收事件流触发特定应用业务逻辑的状态化流式应用。

source: Event-driven applications have quite high requirements on the stream processor that runs them.
zh_cn: 事件驱动型应用对作为载体的底层流处理引擎具有极高的要求。

source: Event-driven applications offer several benefits compared to transactional applica‐ tions or microservices.
zh_cn: 与事务型应用和微服务架构相比，事件驱动型应用有很多优势：

source: Event-time and processing-time semantics.
zh_cn: 同时支持事件时间和处理时间语义。

source: Event-time completely decouples the processing speed from the results.
zh_cn: 事件时间将处理速度和结果内容彻底解耦。

source: Event-time correctly places events in a window, reflecting the reality of how things happened.
zh_cn: 事件时间准确地将事件分配到窗口中，从而反映出真实发生的情况。

source: Event-time is the time when an event in the stream actually happened.
zh_cn: 事件时间是数据流中事件实际发生的时间，

source: Event-time provides consistent and accurate results despite out-of-order events.
zh_cn: 事件时间能够针对无序事件提供一致、精确的结果；

source: Event-time semantics provide consis‐ tent and accurate results despite out-of-order events.
zh_cn: 事件时间语义能够针对无序事件提供一致、精确的结果；

source: Event-time streams also need to carry watermarks from which operators infer the current event time.
zh_cn: 此外事件时间数据流还需要携带水位线，以供算子推断当前事件时间。

source: Event-time timers fire when the next watermark is processed.
zh_cn: 事件时间计时器会在处理下一条水位线时触发。

source: Event-time windows compute deterministic results even when events arrive out of order.
zh_cn: 即便事件乱序到达，事件时间窗口也会计算出确定的结果。

source: Events are buffered in the player’s phone and delivered to the application when the network connection is restored.
zh_cn: 事件会缓存在玩家的手机里，网络恢复后才会发给应用。

source: Events are usually assigned to buckets based on data properties or based on time.
zh_cn: 事件通常会根据其时间或其他数据属性分配到不同桶中。

source: Events are written to a durable, append-only log which means that the order of written events cannot be changed.
zh_cn: 由于事件只能以追加的形式写入持久化日志中，因此其顺序无法在后期改变。

source: Events are written to a durable, append-only log, which means that the order of written events cannot be changed.
zh_cn: 由于事件只能以追加的形式写入持久化日志中，因此其顺序无法在后期改变。

source: Events in a data stream can represent monitoring data, sensor measurements, credit card transactions, weather station observations, online user interactions, web searches, etc.
zh_cn: 数据流中的事件可以表示监控数据、传感器测量值、信用卡交易、气象站观测数据、在线用户交互以及网络搜索等。

source: Events with different keys can be processed by the same task, but the keyed state of a task’s function is always accessed in the scope of the current event’s key.
zh_cn: 虽然键值不同的事件也可能会在同一个任务上处理，但任务函数所能访问的键值分区状态始终会被约束在当前事件键值的范围内。

source: Eventually, the checkpoint barriers arrive at a sink task.
zh_cn: 最终检查点分隔符到达数据汇任务。

source: Every input event is emitted to the next operator.
zh_cn: 每个输入消息都会被发往下游算子。

source: Every record contains an average temperature of a sensor over a period of 5 seconds.
zh_cn: 其每条记录都会包含对应传感器在5秒内的平均温度。

source: Every time a trigger is called it produces a TriggerResult that determines what should happen to the window.
zh_cn: 每次调用触发器都会生成一个TriggerResult，它用于决定窗口接下来的行为。

source: Every time an element is added to a window, it is also passed to the trigger of the win‐ dow.
zh_cn: 每个元素在加入窗口后还会被传递至该窗口的触发器。

source: Every time the sink operator receives a check‐
zh_cn: 数据汇算子每收到一个检查点分隔符都会生成一个新的"记录章节"，并将接下来的所有记录追加写入该章节。

source: Everything contained in a user func‐
zh_cn: 用户函数中的全部内容都必须是可序列化的。

source: Evictors
zh_cn: 移除器

source: Evictors are often applied on a GlobalWindow for partial cleaning of the window— without purging the complete window state.
zh_cn: 移除器常用于GlobalWindow，它只会清理部分窗口内容而不会完全清除整个窗口状态。

source: Evictors iterate over a list of elements in a window.
zh_cn: 移除器会遍历窗口中的元素列表。

source: Evolving Stateful Applications
zh_cn: 更新状态化应用

source: Evolving Stateful Applications | 175
zh_cn: 状态化应用的演变 | 175

source: Exactly-Once
zh_cn: 精确一次

source: Exactly-once
zh_cn: 精确一次

source: Exactly-once guarantees for the Kafka sink
zh_cn: Kafka数据汇的精确一次保障

source: Exactly-once is the strictest guarantee and hard to achieve.
zh_cn: 精确一次是最严格，也是最难实现的一类保障，

source: Exactly-once means that not only will there be no event loss, but also updates on the internal state will be applied exactly once for each event.
zh_cn: 它表示不但没有事件丢失，而且每个事件对于内部状态的更新都只有一次。

source: Exactly-once result guarantees means that not only there will be no event loss, but also updates on the internal state will be applied exactly once for each event.
zh_cn: 精确一次结果保障意味着不但没有事件丢失，而且每个事件对于内部状态的更新都只有一次。

source: Exactly-once state consistency guarantees.
zh_cn: 提供精确一次（exactly-once）的状态一致性保障。

source: Exactly-once state consistency is a requirement for end-to-end exactly-once consistency but is not the same.
zh_cn: 精确一次的状态一致性是实现端到端精确一次一致的需求之一，二者并不一样。

source: Exactly-once*
zh_cn: 精确一次*

source: Example 10-1.
zh_cn: 示例10-1，

source: Example 10-2.
zh_cn: 示例10-2，

source: Example 10-3 shows how to specify slot-sharing groups in a Flink DataStream application.
zh_cn: 示例10-3展示了如何在Flink DataStream应用中指定处理槽共享组。

source: Example 10-3.
zh_cn: 示例10-3，

source: Example 10-4.
zh_cn: 示例10-4，

source: Example 10-5.
zh_cn: 示例10-5，

source: Example 10-6.
zh_cn: 示例10-6，

source: Example 10-7.
zh_cn: 示例10-7，

source: Example 10-8.
zh_cn: 示例10-8，

source: Example 10-9 shows a MapFunction that logs every input record conversion.
zh_cn: 示例10-9展示的MapFunction会将每一次输入记录转换都写入日志。

source: Example 10-9.
zh_cn: 示例10-9，

source: Example 5-1.
zh_cn: 示例5-1，

source: Example 5-2 splits a stream of numbers into a stream of large numbers and a stream of small numbers.
zh_cn: 示例5-2将一条数字流分成一条大数字流和一条小数字流。

source: Example 5-2.
zh_cn: 示例 5-2，

source: Example 5-3.
zh_cn: 示例 5-3，

source: Example 6-1 shows how to set the time characteristic by revisiting the sensor stream‐ ing application code you wrote in “Hello, Flink!” on page 79.
zh_cn: 示例6-1回顾了你在79页完成的"Hello, Flink!"流式应用代码中是如何设置时间特性的：

source: Example 6-1.
zh_cn: 示例6-1，

source: Example 6-10 shows a reduce lambda function that computes the mininum tempera‐ ture per sensor every 15 seconds.
zh_cn: 示例6-10中展示的Lambda函数会计算每15秒的最低温度。

source: Example 6-10.
zh_cn: 示例6-10，

source: Example 6-11 shows how to use an AggregateFunction to compute the average tem‐ perature of sensor readings per window.
zh_cn: 示例6-11展示了如何使用AggregateFunction计算每个窗口内传感器读数的平均温度。

source: Example 6-11.
zh_cn: 示例6-11，

source: Example 6-12 groups the sensor reading stream into tumbling windows of 5 seconds and uses a ProcessWindowFunction to compute the lowest and highest temperature that occur within the window.
zh_cn: 示例6-12将传感器读数流按照每5秒的滚动窗口进行分组，随后使用ProcessWindowFunction计算每个窗口内的最低温和最高温。

source: Example 6-12.
zh_cn: 示例6-12，

source: Example 6-13.
zh_cn: 示例6-13，

source: Example 6-14.
zh_cn: 示例6-14，

source: Example 6-15.
zh_cn: 示例6-15，

source: Example 6-16 shows a trigger that fires early, before the end time of the window is reached.
zh_cn: 示例6-16展示的触发器会在时间到达窗口结束时间之前提前触发。

source: Example 6-16.
zh_cn: 示例6-16，

source: Example 6-17 shows the Evictor interface.
zh_cn: 示例6-17中展示了Evictor接口。

source: Example 6-17.
zh_cn: 示例6-17，

source: Example 6-18.
zh_cn: 示例6-18，

source: Example 6-19 shows how to define a window join.
zh_cn: 示例6-19展示了如何定义基于窗口的Join。

source: Example 6-19.
zh_cn: 示例6-19，

source: Example 6-2.
zh_cn: 示例6-2，

source: Example 6-20 shows how to specify a window operator with a side output for late events.
zh_cn: 示例6-20展示了如何在窗口算子中为迟到事件指定副输出。

source: Example 6-20.
zh_cn: 示例6-20，

source: Example 6-21 shows a ProcessFunction that filters out late sensor readings from its
zh_cn: 示例6-21展示了ProcessFunction如何从输入中过滤出迟到的传感器读数，并将其重定位到副输出流中。

source: Example 6-21.
zh_cn: 示例6-21，

source: Example 6-22.
zh_cn: 示例6-22，

source: Example 6-3 shows an assigner with periodic timestamps that produces watermarks by keeping track of the maximum element timestamp it has seen so far.
zh_cn: 示例6-3展示了一个周期性水位线分配器，它通过跟踪至今为止所见的最大元素时间戳来生成水位线。

source: Example 6-3.
zh_cn: 示例6-3，

source: Example 6-4 shows a punctuated watermark assigner that emits a watermark for every reading it receives from the sensor with the ID "sensor_1".
zh_cn: 示例6-4展示的定点水位线生成器会根据从ID为"sensor_1"的传感器接收到的所有读数产生水位线。

source: Example 6-4.
zh_cn: 示例6-4，

source: Example 6-5.
zh_cn: 示例6-5，

source: Example 6-6 shows how to emit data from a ProcessFunction via DataStream of a side output.
zh_cn: 示例6-6展示了如何利用ProcessFunction向副输出的DataStream发送数据。

source: Example 6-6.
zh_cn: 示例6-6，

source: Example 6-7 shows the FreezingMonitor function that monitors a stream of sensor readings and emits a warning to a side output for readings with a temperature below
zh_cn: 示例6-7所示的FreezingMonitor函数用于监控传感器读数流，它会对读数温度低于32°F的记录向副输出发送警告。

source: Example 6-7.
zh_cn: 示例6-7，

source: Example 6-8 shows how to apply a CoProcessFunction to combine two streams.
zh_cn: 示例6-8展示了如何使用CoProcessFunction来结合两条数据流。

source: Example 6-8.
zh_cn: 示例6-8，

source: Example 6-9.
zh_cn: 示例6-9，

source: Example 7-1 shows how to apply a FlatMapFunction with a keyed ValueState on a stream of sensor measurements.
zh_cn: 示例7-1展示了如何在一条传感数据测量流上应用一个带有键值分区ValueState的FlatMapFunction。

source: Example 7-1.
zh_cn: 示例7-1，

source: Example 7-10.
zh_cn: 示例7-10，

source: Example 7-11.
zh_cn: 示例7-11，

source: Example 7-12 shows how to configure a state backend (here, RocksDBStateBackend) for an application and all its stateful functions.
zh_cn: 示例7-12展示了如何为应用及其状态化函数配置状态后端（此处选用RocksDBStateBackend）。

source: Example 7-12.
zh_cn: 示例7-12，

source: Example 7-13 shows a KeyedProcessFunction that compares two subsequent tem‐ perature measurements and raises an alert if the difference is greater than a certain
zh_cn: 示例7-13展示的KeyedProcessFunction会对两个连续的温度测量值进行比较，如果二者的差值大于一个特定阈值就会发出警报。

source: Example 7-13.
zh_cn: 示例7-13，

source: Example 7-14 shows how to make lastTempState queryable to illustrate the usage of the keyed state.
zh_cn: 示例7-14中以lastTempState状态为例，说明了如何将键值分区状态设置为可查询的。

source: Example 7-14.
zh_cn: 示例7-14，

source: Example 7-15 shows how to use a queryable state sink.
zh_cn: 示例7-15展示了如何使用可查询式状态的数据汇。

source: Example 7-15.
zh_cn: 示例7-15，

source: Example 7-16.
zh_cn: 示例7-16，
